zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_aes.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_aes.h
 *  @brief      Advanced Encryption Standard (AES) Driver Library. AES 高级加密标准驱动库。
 *  @defgroup   AES Advanced Encryption Standard (AES)
 *
 *  @anchor ti_dl_dl_aes_Overview
 *  # Overview
 *
 *  The AES DriverLib allows full configuration of the MSPM0 AES module.
 *  The AES accelerator module accelerates encryption and decryption operations in hardware based
 *  on the FIPS PUB 197 advanced encryption standard (AES).
 *
 *  @par 文件说明
 *  本头文件提供 MSPM0G3507 芯片 AES 硬件加速模块的完整驱动接口，支持 ECB/CBC/OFB/CFB
 *  四种加密模式的加解密操作，密钥长度支持 128 位和 256 位。同时提供 DMA 触发、中断管理及
 *  低功耗状态下的配置备份与恢复功能。
 *
 *  <hr>
 ******************************************************************************/
/** @addtogroup AES
 * @{
 */
#ifndef ti_dl_dl_aes__include
#define ti_dl_dl_aes__include

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_AES__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/*!
 * @brief AES Ready interrupt. AES 就绪中断。
 */
#define DL_AES_INTERRUPT_AES_READY            (AES_CPU_INT_IMASK_AESRDY_MASK)

/*!
 * @brief DMA Trigger Event 0. DMA 触发事件 0。
 */
#define DL_AES_EVENT_AES_DMA_TRIGGER0           (AES_DMA_TRIG0_IMASK_DMA0_MASK)

/*!
 * @brief DMA Trigger Event 1. DMA 触发事件 1。
 */
#define DL_AES_EVENT_AES_DMA_TRIGGER1            (AES_DMA_TRIG1_IMASK_DMA1_SET)

/*!
 * @brief DMA Trigger Event 2. DMA 触发事件 2。
 */
#define DL_AES_EVENT_AES_DMA_TRIGGER2            (AES_DMA_TRIG2_IMASK_DMA2_SET)

/* clang-format on */

/*! @enum DL_AES_MODE
 *  AES 工作模式枚举，组合了操作类型（加密/解密/生成首轮密钥）与分组模式（ECB/CBC/OFB/CFB）。
 */
typedef enum {
    /*! @brief Selects encryption using Electronic Code Book (ECB) mode. 使用 ECB 模式加密。 */
    DL_AES_MODE_ENCRYPT_ECB_MODE =
        (AES_AESACTL0_OPX_OP0 | AES_AESACTL0_CMX_ECB),

    /*! @brief Selects encryption using Cipher Block Chaining (CBC) mode. 使用 CBC 模式加密。 */
    DL_AES_MODE_ENCRYPT_CBC_MODE =
        (AES_AESACTL0_OPX_OP0 | AES_AESACTL0_CMX_CBC),

    /*! @brief Selects encryption using Output Feedback (OFB) mode. 使用 OFB 模式加密。 */
    DL_AES_MODE_ENCRYPT_OFB_MODE =
        (AES_AESACTL0_OPX_OP0 | AES_AESACTL0_CMX_OFB),

    /*! @brief Selects encryption using Cipher Feedback (CFB) mode. 使用 CFB 模式加密。 */
    DL_AES_MODE_ENCRYPT_CFB_MODE =
        (AES_AESACTL0_OPX_OP0 | AES_AESACTL0_CMX_CFB),

    /*! @brief Selects decryption using Electronic Code Book (ECB) mode. 使用 ECB 模式解密（相同密钥）。 */
    DL_AES_MODE_DECRYPT_SAME_KEY_ECB_MODE =
        (AES_AESACTL0_OPX_OP1 | AES_AESACTL0_CMX_ECB),

    /*! @brief Selects decryption using Cipher Block Chaining (CBC) mode. 使用 CBC 模式解密（相同密钥）。 */
    DL_AES_MODE_DECRYPT_SAME_KEY_CBC_MODE =
        (AES_AESACTL0_OPX_OP1 | AES_AESACTL0_CMX_CBC),

    /*! @brief Selects decryption using Output Feedback (OFB) mode. 使用 OFB 模式解密（相同密钥）。 */
    DL_AES_MODE_DECRYPT_SAME_KEY_OFB_MODE =
        (AES_AESACTL0_OPX_OP1 | AES_AESACTL0_CMX_OFB),

    /*! @brief Selects decryption using Cipher Feedback (CFB) mode. 使用 CFB 模式解密（相同密钥）。 */
    DL_AES_MODE_DECRYPT_SAME_KEY_CFB_MODE =
        (AES_AESACTL0_OPX_OP1 | AES_AESACTL0_CMX_CFB),

    /*! @brief Selects first round key for Electronic Code Book (ECB) mode. 生成 ECB 模式的首轮密钥。 */
    DL_AES_MODE_GEN_FIRST_ROUND_KEY_ECB_MODE =
        (AES_AESACTL0_OPX_OP2 | AES_AESACTL0_CMX_ECB),

    /*! @brief Selects first round key using Cipher Block Chaining (CBC) mode. 生成 CBC 模式的首轮密钥。 */
    DL_AES_MODE_GEN_FIRST_ROUND_KEY_CBC_MODE =
        (AES_AESACTL0_OPX_OP2 | AES_AESACTL0_CMX_CBC),

    /*! @brief Selects first round key using Output Feedback (OFB) mode. 生成 OFB 模式的首轮密钥。 */
    DL_AES_MODE_GEN_FIRST_ROUND_KEY_OFB_MODE =
        (AES_AESACTL0_OPX_OP2 | AES_AESACTL0_CMX_OFB),

    /*! @brief Selects first round key using Cipher Feedback (CFB) mode. 生成 CFB 模式的首轮密钥。 */
    DL_AES_MODE_GEN_FIRST_ROUND_KEY_CFB_MODE =
        (AES_AESACTL0_OPX_OP2 | AES_AESACTL0_CMX_CFB),

    /*! @brief Selects decryption with 1st round key using ECB mode. 使用首轮密钥进行 ECB 解密。 */
    DL_AES_MODE_DECRYPT_KEY_IS_FIRST_ROUND_KEY_ECB_MODE =
        (AES_AESACTL0_OPX_OP3 | AES_AESACTL0_CMX_ECB),

    /*! @brief Selects decryption with 1st round key using CBC mode. 使用首轮密钥进行 CBC 解密。 */
    DL_AES_MODE_DECRYPT_KEY_IS_FIRST_ROUND_KEY_CBC_MODE =
        (AES_AESACTL0_OPX_OP3 | AES_AESACTL0_CMX_CBC),

