zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_aes.h
    /*! @brief Selects decryption with 1st round key using OFB mode. 使用首轮密钥进行 OFB 解密。 */
    DL_AES_MODE_DECRYPT_KEY_IS_FIRST_ROUND_KEY_OFB_MODE =
        (AES_AESACTL0_OPX_OP3 | AES_AESACTL0_CMX_OFB),

    /*! @brief Selects decryption with 1st round key using CFB mode. 使用首轮密钥进行 CFB 解密。 */
    DL_AES_MODE_DECRYPT_KEY_IS_FIRST_ROUND_KEY_CFB_MODE =
        (AES_AESACTL0_OPX_OP3 | AES_AESACTL0_CMX_CFB),
} DL_AES_MODE;

/*! @enum DL_AES_IIDX
 *  AES 中断索引枚举，用于标识各中断/DMA 触发事件的优先级编号。
 */
typedef enum {
    /*! AES interrupt index for AES module ready. AES 模块就绪中断索引。 */
    DL_AES_IIDX_AES_READY = AES_CPU_INT_IIDX_STAT_AESRDY,
    /*! AES interrupt index for enabling DMA trigger event 0. DMA 触发事件 0 中断索引。 */
    DL_AES_IIDX_AES_DMA_TRIGGER0 = AES_DMA_TRIG0_IIDX_STAT_DMA0,
    /*! AES interrupt index for enabling DMA trigger event 1. DMA 触发事件 1 中断索引。 */
    DL_AES_IIDX_AES_DMA_TRIGGER1 = AES_DMA_TRIG1_IIDX_STAT_DMA1,
    /*! AES interrupt index for enabling DMA trigger event 2. DMA 触发事件 2 中断索引。 */
    DL_AES_IIDX_AES_DMA_TRIGGER2 = AES_DMA_TRIG2_IIDX_STAT_DMA2
} DL_AES_IIDX;

/*! @enum DL_AES_OPERATION
 *  AES 操作类型枚举。
 */
typedef enum {
    /*! Encryption mode selected. 加密模式。 */
    DL_AES_OPERATION_ENC = AES_AESACTL0_OPX_OP0,
    /*! Decryption. The provided key is the same key used for encryption. 解密（使用原始加密密钥）。 */
    DL_AES_OPERATION_DEC_SAME_KEY = AES_AESACTL0_OPX_OP1,
    /*! Generate first round key required for decryption. 生成解密所需的首轮密钥。 */
    DL_AES_OPERATION_GEN_FIRST_ROUND = AES_AESACTL0_OPX_OP2,
    /*! Decryption. The provided key is the first round key required for
     *  decryption. 解密（提供的是首轮密钥）。 */
    DL_AES_OPERATION_DEC_KEY_IS_FIRST_ROUND = AES_AESACTL0_OPX_OP3,
} DL_AES_OPERATION;

/*! @enum DL_AES_KEY_LENGTH
 *  AES 密钥长度枚举。
 */
typedef enum {
    /*! Key length set to 128. 密钥长度 128 位。 */
    DL_AES_KEY_LENGTH_128 = AES_AESACTL0_KLX_AES128,
    /*! Key length set to 256. 密钥长度 256 位。 */
    DL_AES_KEY_LENGTH_256 = AES_AESACTL0_KLX_AES256,
} DL_AES_KEY_LENGTH;

/*! @enum DL_AES_STATUS
 *  AES 操作状态枚举。
 */
typedef enum {
    /*! Operation was successful. 操作成功。 */
    DL_AES_STATUS_SUCCESS,
    /*! Operation was not performed because address was unaligned. 操作未执行，地址未对齐。 */
    DL_AES_STATUS_UNALIGNED_ACCESS,
} DL_AES_STATUS;

/**
 * @brief Configuration structure to backup AES peripheral state before going
 *        to STOP/STANDBY mode. Used by @ref DL_AES_saveConfiguration
 *        AES 外设配置备份结构体，用于在进入 STOP/STANDBY 模式前保存状态。
 */
typedef struct {
    /*! Combination of AESACTL0 fields, compressed to a single word as they
     *  are stored in the AES registers. See @ref DL_AES_init for
     *  how the peripheral control word 0 is created
     *  AESACTL0 寄存器字段组合（控制字 0）。 */
    uint32_t controlWord0;
    /*! Combination of AESACTL1 fields, compressed to a single word as they
     *  are stored in the AES registers. See @ref DL_AES_init for
     *  how the peripheral control word 1 is created
     *  AESACTL1 寄存器字段组合（控制字 1）。 */
    uint32_t controlWord1;
    /*! AES interrupt mask 0. Value of @ref DL_AES_INTERRUPT_AES_READY stored
     * from the current state of the AES Interrupt Event 0 register set
     *  AES 就绪中断掩码。 */
    uint32_t interruptMask0;
    /*! AES interrupt mask 1. Value of @ref DL_AES_EVENT_AES_DMA_TRIGGER0 stored
     *  from the current state of the AES Interrupt Event 1 register set
     *  DMA 触发事件 0 中断掩码。 */
    uint32_t interruptMask1;
    /*! AES interrupt mask 2. Value of @ref DL_AES_EVENT_AES_DMA_TRIGGER1 stored
     * from the current state of the AES Interrupt Event 2 register set
     *  DMA 触发事件 1 中断掩码。 */
    uint32_t interruptMask2;
    /*! AES interrupt mask 3. Value of @ref DL_AES_EVENT_AES_DMA_TRIGGER2 stored
     * from the current state of the AES Interrupt Event 3 register set
     *  DMA 触发事件 2 中断掩码。 */
    uint32_t interruptMask3;
    /*! Boolean flag indicating whether or not a valid configuration structure
       exists. Should not be modified by the user.
       备份就绪标志，用户不应修改此字段。 */
    bool backupRdy;
} DL_AES_backupConfig;

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the AES
 *        使能 AES 外设写使能寄存器。
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 * @param aes        Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_enablePower(AES_Regs *aes)
{
    aes->GPRCM.PWREN = (AES_PWREN_KEY_UNLOCK_W | AES_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the AES
 *        禁用 AES 外设写使能寄存器。
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 * @param aes        Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_disablePower(AES_Regs *aes)
{
    aes->GPRCM.PWREN = (AES_PWREN_KEY_UNLOCK_W | AES_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the AES
 *        is enabled
 *        查询 AES 外设写使能是否已开启。
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param aes        Pointer to the register overlay for the peripheral
 *                    外设寄存器基地址指针。
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 *         外设寄存器访问已使能返回 true，否则返回 false。
 */
__STATIC_INLINE bool DL_AES_isPowerEnabled(const AES_Regs *aes)
{
    return (
        (aes->GPRCM.PWREN & AES_PWREN_ENABLE_MASK) == AES_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Resets AES peripheral
 *        复位 AES 外设。
 *
 * @param aes        Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_reset(AES_Regs *aes)
{
    aes->GPRCM.RSTCTL =
        (AES_RSTCTL_KEY_UNLOCK_W | AES_RSTCTL_RESETSTKYCLR_CLR |
            AES_RSTCTL_RESETASSERT_ASSERT);
}

/**
 * @brief Returns if AES peripheral was reset
 *        查询 AES 外设是否已复位。
 *
 * @param aes        Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *         已复位返回 true，未复位返回 false。
 */
__STATIC_INLINE bool DL_AES_isReset(const AES_Regs *aes)
{
    return ((aes->GPRCM.STAT & AES_STAT_RESETSTKY_MASK) ==
            AES_STAT_RESETSTKY_RESET);
}

/**
 *  @brief  Initializes AES peripheral
 *          初始化 AES 外设。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 *  @param[in] aesConfig     Configures AES cipher mode, key length and
 *                           operation configuration. One of @ref DL_AES_MODE
 *                           AES 加密模式配置，取值参见 @ref DL_AES_MODE。
 *  @param[in] keyLength     Configures AES key length. One of
 *                           @ref DL_AES_KEY_LENGTH
 *                           AES 密钥长度，取值参见 @ref DL_AES_KEY_LENGTH。
 */

__STATIC_INLINE void DL_AES_init(
    AES_Regs *aes, DL_AES_MODE aesConfig, DL_AES_KEY_LENGTH keyLength)
{
    DL_Common_updateReg(&aes->AESACTL0,
        ((uint32_t) aesConfig | (uint32_t) keyLength),
        (uint32_t)(AES_AESACTL0_OPX_MASK | AES_AESACTL0_CMX_MASK |
                   AES_AESACTL0_KLX_MASK));
}

/**
 *  @brief Immediately resets the complete AES accelerator module even when
 *         busy.
 *         立即复位整个 AES 加速器模块（即使模块正忙）。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 */

__STATIC_INLINE void DL_AES_softwareReset(AES_Regs *aes)
{
    aes->AESACTL0 |= (AES_AESACTL0_SWRST_RST);
}

/**
 *  @brief Returns status of AES error flag
 *         查询 AES 错误标志状态。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 *  @return Status of AES module fault flag
 *          AES 模块错误标志状态。
 *
 *  @retval true flag is set
 *  @retval false flag is cleared
 *          标志置位返回 true，清除返回 false。
 */
__STATIC_INLINE bool DL_AES_isFaultFlagSet(const AES_Regs *aes)
{
    return (
        (aes->AESACTL0 & AES_AESACTL0_ERRFG_MASK) == AES_AESACTL0_ERRFG_ERR);
}

/**
 *  @brief Clears AES error flag
 *         清除 AES 错误标志。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_clearFaultFlag(AES_Regs *aes)
{
    aes->AESACTL0 &= ~(AES_AESACTL0_ERRFG_ERR);
}

/**
 *  @brief Enables cipher mode
 *         使能分组加密模式。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_enableCipherMode(AES_Regs *aes)
{
    aes->AESACTL0 |= (AES_AESACTL0_CMEN_ENABLE);
}

/**
 *  @brief Disables cipher mode
 *         禁用分组加密模式。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_disablesCipherMode(AES_Regs *aes)
{
    aes->AESACTL0 &= ~(AES_AESACTL0_CMEN_ENABLE);
}

/**
 * @brief Set cipher block counter value
 *        设置分组加密块计数器值。
 *
 * Sets the number of blocks to be encrypted or decrypted, the block counter
 * decrements with each performed encryption or decryption.
 * Block cipher mode must be enabled with @ref DL_AES_enableCipherMode. If block
 * cipher mode is disabled, writes to this register are ignored.
 * If this register has a value > 0 and block cipher mode has been enabled,
 * further writes to this register are ignored until the value of this register
 * is 0.
 *
 * @param       aes      Pointer to the register overlay for the peripheral
 *                       外设寄存器基地址指针。
 *
 *  @param[in]  count    The value to set the cipher block counter to.
 *                       Value between [0x0, 0xFF]
 *                       计数器值，范围 [0x0, 0xFF]。
 *
 * @sa          DL_AES_enableCipherMode
 */
__STATIC_INLINE void DL_AES_setCipherBlockCounter(
    AES_Regs *aes, uint32_t count)
{
    DL_Common_updateReg(&aes->AESACTL1, count, AES_AESACTL1_BLKCNTX_MASK);
}

/**
 * @brief Get current cipher block counter value
 *        获取当前分组加密块计数器值。
 *
 * The block counter decrements with each performed encryption or decryption.
 *
 * @param aes        Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 *
 * @return           The current cipher block counter value
 *                   当前分组块计数器值。
 *
 * @retval           Value between [0x0, 0xFF]
 */
__STATIC_INLINE uint32_t DL_AES_getCipherBlockCounter(const AES_Regs *aes)
{
    return (aes->AESACTL1 & AES_AESACTL1_BLKCNTX_MASK);
}

/**
 *
 * @brief Gets the AES module busy status.
 *       获取 AES 模块忙状态。
 *
 * @param[in] aes           Pointer to the register overlay for the
 *                          peripheral
 *                          外设寄存器基地址指针。
 * @return Status of AES module
 *         AES 模块状态。
 *
 * @retval true. Module is busy
 * @retval false. Module is in idle state
 *         模块忙返回 true，空闲返回 false。
 */
__STATIC_INLINE bool DL_AES_isBusy(const AES_Regs *aes)
{
    return (
        (aes->AESASTAT & AES_AESASTAT_BUSY_MASK) == AES_AESASTAT_BUSY_BUSY);
}

/**
 *
 * @brief Gets the DATAOUT read status
 *       获取数据输出读取状态。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 * @return Status of DATAOUT read status
 *         DATAOUT 读取状态。
 *
 * @retval true. All bytes read
 * @retval false. Not all bytes read
 *         全部字节已读取返回 true，否则返回 false。
 */
__STATIC_INLINE bool DL_AES_getDataOutReadStatus(const AES_Regs *aes)
{
    return (
        (aes->AESASTAT & AES_AESASTAT_DOUTRD_MASK) == AES_AESASTAT_DOUTRD_ALL);
}

/**
 *
 * @brief Gets Key byte count
 *       获取已加载的密钥字节数。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 * @return Number of Key bytes loaded
 *         已加载的密钥字节数。
 */
__STATIC_INLINE uint8_t DL_AES_getKeyBytesCount(const AES_Regs *aes)
{
    return ((uint8_t)((aes->AESASTAT & AES_AESASTAT_KEYCNTX_MAXNUM) >> 4));
}

/**
 *
 * @brief Gets Data In byte count
 *       获取已加载的输入数据字节数。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 * @return Number of Data In bytes loaded
 *         已加载的输入数据字节数。
 */
__STATIC_INLINE uint8_t DL_AES_getDataInBytesCount(const AES_Regs *aes)
{
    return ((uint8_t)((aes->AESASTAT & AES_AESASTAT_DINCNTX_MAXNUM) >> 8));
}

/**
 *
 * @brief Gets Data Out byte count
 *       获取已输出的数据字节数。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 * @return Number of Data Out bytes loaded
 *         已输出的数据字节数。
 */
__STATIC_INLINE uint8_t DL_AES_getDataOutBytesCount(const AES_Regs *aes)
{
    return ((uint8_t)((aes->AESASTAT & AES_AESASTAT_DOUTCNTX_MAXNUM) >> 12));
}

/**
 *
 * @brief Set bit to write all STATE bytes to STATE registers
 *        and triggers a new encryption
 *        置位标志以将所有 STATE 字节写入寄存器并触发新一轮加密。
 *
 * @param[in] aes            Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_setAllDataWritten(AES_Regs *aes)
{
    aes->AESASTAT |= AES_AESASTAT_DINWR_ALL;
}

/**
 *
 * @brief Set bit to write all KEY bytes to KEY register,
 *        which is used to encrypt and decrypt data
 *        置位标志以将所有 KEY 字节写入密钥寄存器。
 *
 * @param[in] aes            Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_setAllKeyWritten(AES_Regs *aes)
{
    aes->AESASTAT |= AES_AESASTAT_KEYWR_ALL;
}

/**
 *
 * @brief Check if all bytes are to be written to
 *        registers containing STATE info
 *        检查所有 STATE 字节是否已写入寄存器。
 *
 * @param[in] aes            Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 * @retval true All bytes are written to these registers
 * @retval false Not all bytes are written to these registers
 *         全部字节已写入返回 true，否则返回 false。
 */
__STATIC_INLINE bool DL_AES_isAllDataWritten(const AES_Regs *aes)
{
    return (aes->AESASTAT & AES_AESASTAT_DINWR_MASK) == AES_AESASTAT_DINWR_ALL;
}

/**
 *
 * @brief Check if all bytes are to be written to
 *        registers containing KEY info
 *        检查所有 KEY 字节是否已写入寄存器。
 *
 * @param[in] aes            Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 * @retval true All bytes are written to these registers
 * @retval false Not all bytes are written to these registers
 *         全部字节已写入返回 true，否则返回 false。
 */
__STATIC_INLINE bool DL_AES_isAllKeysWritten(const AES_Regs *aes)
{
    return (aes->AESASTAT & AES_AESASTAT_KEYWR_MASK) == AES_AESASTAT_KEYWR_ALL;
}

/**
 *
 *  @brief Loads a 128 or 256 bit key to AES module.
 *         向 AES 模块加载 128 位或 256 位密钥。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 *  @param[in] key           Pointer to an aligned uint8_t array that contains
 *                           the cipher key.
 *                           指向对齐的 uint8_t 密钥数组的指针。
 *
 *  @param[in] keyLength     length of the key. One of @ref DL_AES_KEY_LENGTH
 *                           密钥长度，取值参见 @ref DL_AES_KEY_LENGTH。
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AES_STATUS.
 *          操作状态。未 32 位对齐则失败，取值参见 @ref DL_AES_STATUS。
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AES_setKeyAligned
 *
 */
DL_AES_STATUS DL_AES_setKey(
    AES_Regs *aes, const uint8_t *key, DL_AES_KEY_LENGTH keyLength);

/**
 *
 *  @brief Loads a 128 or 256 bit key to AES module.
 *         向 AES 模块加载 128 位或 256 位密钥（已对齐版本）。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *
 *  @param[in] keyAligned    Pointer to an uint32_t array that contains the
 *                           cipher key.
 *                           指向对齐的 uint32_t 密钥数组的指针。
 *
 *  @param[in] keyLength     length of the key. One of @ref DL_AES_KEY_LENGTH
 *                           密钥长度，取值参见 @ref DL_AES_KEY_LENGTH。
 *
 *  @sa DL_AES_setKey
 *
 */
void DL_AES_setKeyAligned(
    AES_Regs *aes, const uint32_t *keyAligned, DL_AES_KEY_LENGTH keyLength);

/**
 *
 *  @brief XORs an AES 128-bit block of data in software
 *         软件实现的 128 位数据块异或操作。
 *
 *  @param[in] data           Pointer to initial data block for the operation
 *                            指向初始数据块的指针。
 *  @param[in] xorData        Pointer to 128-bit data block to xor with data
 *                            指待异或的 128 位数据块指针。
 *  @param[out] xorOutputData Pointer to output block of data ^ xorData
 *                            指向输出数据块的指针（data ^ xorData）。
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AES_STATUS.
 *          操作状态。未 32 位对齐则失败，取值参见 @ref DL_AES_STATUS。
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AES_xorDataAligned
 *
 */
DL_AES_STATUS DL_AES_xorData(
    const uint8_t *data, const uint8_t *xorData, uint8_t *xorOutputData);

/**
 *
 *  @brief XORs an aligned 128-bit data block in software
 *         软件实现的已对齐 128 位数据块异或操作。
 *
 *  @param[in] dataAligned           Pointer to initial data block for the
 *                                   operation
 *                                   指向初始数据块的指针。
 *  @param[in] xorDataAligned        Pointer to 128-bit data block to xor with
 *                                   data
 *                                   指向待异或的 128 位数据块指针。
 *  @param[out] xorOutputDataAligned Pointer to output block of data ^ xorData
 *                                   指向输出数据块的指针（data ^ xorData）。
 *
 *  @sa DL_AES_xorData
 */
void DL_AES_xorDataAligned(uint32_t *dataAligned, uint32_t *xorDataAligned,
    uint32_t *xorOutputDataAligned);

/**
 *
 *  @brief Encrypts a block of data using the AES module.
 *         使用 AES 模块加载一个待加密数据块。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] data          Is a pointer to an aligned uint8_t array with a
 *                           length of 16 that contains data to be encrypted.
 *                           指向 16 字节对齐的 uint8_t 待加密数据数组的指针。
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AES_STATUS.
 *          操作状态。未 32 位对齐则失败，取值参见 @ref DL_AES_STATUS。
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AES_loadDataInAligned
 */
DL_AES_STATUS DL_AES_loadDataIn(AES_Regs *aes, const uint8_t *data);

/**
 *
 *  @brief Encrypts a block of data using the AES module.
 *         使用 AES 模块加载一个待加密数据块（已对齐版本）。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] dataAligned   Is a pointer to an uint32_t array with a length of
 *                           4 that contains data to be encrypted.
 *                           指向 4 个 uint32_t 元素的待加密数据数组的指针。
 *
 *  @sa DL_AES_loadDataIn
 *
 */
void DL_AES_loadDataInAligned(AES_Regs *aes, const uint32_t *dataAligned);

/**
 *
 *  @brief Gets output of encrypted data
 *         获取 AES 模块加密/解密后的输出数据。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[out] data         Is a pointer to an uint8_t array with a length of
 *                           16 where the output of the AES module will
 *                           be placed.
 *                           指向 16 字节 uint8_t 输出数组的指针。
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AES_STATUS.
 *          操作状态。未 32 位对齐则失败，取值参见 @ref DL_AES_STATUS。
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        writes, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AES_getDataOutAligned
 */
DL_AES_STATUS DL_AES_getDataOut(const AES_Regs *aes, uint8_t *data);

/**
 *
 *  @brief Gets output of encrypted data
 *         获取 AES 模块加密/解密后的输出数据（已对齐版本）。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] dataAligned   Is a pointer to an uint32_t array with a length of
 *                           4 where the output of the AES module will
 *                           be placed.
 *                           指向 4 个 uint32_t 元素的输出数组的指针。
 *  @sa DL_AES_getDataOut
 *
 */
void DL_AES_getDataOutAligned(const AES_Regs *aes, uint32_t *dataAligned);

/**
 *
 *  @brief Data is XORed with the current word of the state and then block of
 *         data is encrypted. Encryption or decryption is started immediately
 *         after loading data.
 *         数据与当前状态字异或后加载，加载后立即开始加密/解密。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] data          Is a pointer to an aligned uint8_t array with a
 *                           length of 16 that contains data to be encrypted.
 *                           指向 16 字节对齐的 uint8_t 数据数组的指针。
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AES_STATUS.
 *          操作状态。未 32 位对齐则失败，取值参见 @ref DL_AES_STATUS。
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AES_loadXORDataInAligned
 *
 */
DL_AES_STATUS DL_AES_loadXORDataIn(AES_Regs *aes, const uint8_t *data);

/**
 *
 *  @brief Data is XORed with the current word of the state and then block of
 *         data is encrypted. Encryption or decryption is started immediately
 *         after loading data.
 *         数据与当前状态字异或后加载，加载后立即开始加密/解密（已对齐版本）。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] dataAligned   Is a pointer to an uint32_t array with a length of
 *                           4 that contains data to be encrypted.
 *                           指向 4 个 uint32_t 元素的数据数组的指针。
 *
 *  @sa DL_AES_loadXORDataIn
 *
 */
void DL_AES_loadXORDataInAligned(AES_Regs *aes, const uint32_t *dataAligned);

