zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_aes.h
/**
 *
 *  @brief Data is XORed with the current word of the state and then block of
 *         data is encrypted. Encryption or decryption is NOT started after
 *         loading data.
 *         数据与当前状态字异或后加载，加载后不自动开始加密/解密。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] data          Is a pointer to an aligned uint8_t array with a
 *                           length of 16 that contains data to be encrypted.
 *                           指向 16 字节对齐的 uint8_t 数据数组的指针。
 *
 *  @return Status of operation. Operation will fail if not 32-bit aligned. One
 *          of @ref DL_AES_STATUS.
 *          操作状态。未 32 位对齐则失败，取值参见 @ref DL_AES_STATUS。
 *
 *  @note This function adds additional cycles in order to verify no unaligned
 *        access, if this is not necessary, consider using uint32_t pointers and
 *        @ref DL_AES_loadXORDataInWithoutTriggerAligned
 *
 */
DL_AES_STATUS DL_AES_loadXORDataInWithoutTrigger(
    AES_Regs *aes, const uint8_t *data);

/**
 *
 *  @brief Data is XORed with the current word of the state and then block of
 *         data is encrypted. Encryption or decryption is NOT started after
 *         loading data.
 *         数据与当前状态字异或后加载，加载后不自动开始加密/解密（已对齐版本）。
 *
 *  @param[in] aes           Pointer to the register overlay for the
 *                           peripheral
 *                           外设寄存器基地址指针。
 *  @param[in] dataAligned   Is a pointer to an uint32_t array with a length of
 *                           4 that contains data to be encrypted.
 *                           指向 4 个 uint32_t 元素的数据数组的指针。
 *
 *  @sa DL_AES_loadXORDataInWithoutTrigger
 *
 */
void DL_AES_loadXORDataInWithoutTriggerAligned(
    AES_Regs *aes, const uint32_t *dataAligned);

/**
 *  @brief      Enable AES Ready interrupt
 *              使能 AES 就绪中断。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_enableInterrupt(AES_Regs *aes)
{
    aes->CPU_INT.IMASK |= DL_AES_INTERRUPT_AES_READY;
}

/**
 *  @brief      Enables DMA trigger 0 to publish AES events to the DMA
 *              使能 DMA 触发器 0 以向 DMA 发布 AES 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_enableDMATrigger0Interrupt(AES_Regs *aes)
{
    aes->DMA_TRIG0.IMASK |= DL_AES_EVENT_AES_DMA_TRIGGER0;
}

/**
 *  @brief      Enables DMA trigger 1 to publish AES events to the DMA
 *              使能 DMA 触发器 1 以向 DMA 发布 AES 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_enableDMATrigger1Interrupt(AES_Regs *aes)
{
    aes->DMA_TRIG1.IMASK |= DL_AES_EVENT_AES_DMA_TRIGGER1;
}

/**
 *  @brief      Enables DMA trigger 2 to publish AES events to the DMA
 *              使能 DMA 触发器 2 以向 DMA 发布 AES 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_enableDMATrigger2Interrupt(AES_Regs *aes)
{
    aes->DMA_TRIG2.IMASK |= DL_AES_EVENT_AES_DMA_TRIGGER2;
}

/**
 *  @brief      Disable AES Ready interrupt
 *              禁用 AES 就绪中断。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_disableInterrupt(AES_Regs *aes)
{
    aes->CPU_INT.IMASK &= ~(AES_CPU_INT_IMASK_AESRDY_MASK);
}

/**
 *  @brief      Disable DMA Trigger 0 Event
 *              禁用 DMA 触发器 0 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_disableDMATrigger0Event(AES_Regs *aes)
{
    aes->DMA_TRIG0.IMASK &= ~(AES_DMA_TRIG0_IMASK_DMA0_MASK);
}

/**
 *  @brief      Disable DMA Trigger 1 Event
 *              禁用 DMA 触发器 1 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_disableDMATrigger1Event(AES_Regs *aes)
{
    aes->DMA_TRIG1.IMASK &= ~(AES_DMA_TRIG1_IMASK_DMA1_MASK);
}

/**
 *  @brief      Disable DMA Trigger 2 Event
 *              禁用 DMA 触发器 2 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_disableDMATrigger2Event(AES_Regs *aes)
{
    aes->DMA_TRIG2.IMASK &= ~(AES_DMA_TRIG2_IMASK_DMA2_MASK);
}

/**
 *  @brief      Check if AES Ready interrupt is enabled
 *              查询 AES 就绪中断是否已使能。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If AES Ready interrupt is enabled
 *              AES 就绪中断是否已使能。
 *
 *  @retval      DL_AES_INTERRUPT_AES_READY if AES Ready interrupt is enabled
 *  @retval      0 if AES Ready interrupt is not enabled
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledInterrupts(const AES_Regs *aes)
{
    return (aes->CPU_INT.IMASK & AES_CPU_INT_IMASK_AESRDY_MASK);
}

/**
 *  @brief      Check if DMA Trigger 0 Event is enabled
 *              查询 DMA 触发器 0 事件是否已使能。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 0 Event is enabled
 *              DMA 触发器 0 事件是否已使能。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER0 if DMA Trigger 0 Event is enabled
 *  @retval      0 if DMA Trigger 0 Event is not enabled
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledDMATrigger0Event(const AES_Regs *aes)
{
    return (aes->DMA_TRIG0.IMASK & AES_DMA_TRIG0_IMASK_DMA0_MASK);
}

/**
 *  @brief      Check if DMA Trigger 1 Event is enabled
 *              查询 DMA 触发器 1 事件是否已使能。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 1 Event is enabled
 *              DMA 触发器 1 事件是否已使能。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER1 if DMA Trigger 1 Event is enabled
 *  @retval      0 if DMA Trigger 1 Event is not enabled
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledDMATrigger1Event(const AES_Regs *aes)
{
    return (aes->DMA_TRIG1.IMASK & AES_DMA_TRIG1_IMASK_DMA1_MASK);
}

/**
 *  @brief      Check if DMA Trigger 2 Event is enabled
 *              查询 DMA 触发器 2 事件是否已使能。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 2 Event is enabled
 *              DMA 触发器 2 事件是否已使能。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER2 if DMA Trigger 2 Event is enabled
 *  @retval      0 if DMA Trigger 2 Event is not enabled
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledDMATrigger2Event(const AES_Regs *aes)
{
    return (aes->DMA_TRIG2.IMASK & AES_DMA_TRIG2_IMASK_DMA2_MASK);
}

/**
 *  @brief      Check interrupt flag of AES Ready interrupt
 *              检查 AES 就绪中断标志（需先使能中断）。
 *
 *  Checks if AES Ready interrupt that was previously enabled is pending.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If AES Ready interrupt is pending
 *              AES 就绪中断是否挂起。
 *
 *  @retval      DL_AES_INTERRUPT_AES_READY if AES Ready interrupt is pending
 *  @retval      0 if AES Ready interrupt is not pending
 *
 *  @sa         DL_AES_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledInterruptStatus(const AES_Regs *aes)
{
    return (aes->CPU_INT.MIS & AES_CPU_INT_IMASK_AESRDY_MASK);
}

/**
 *  @brief      Check interrupt flag of DMA Trigger 0 Event
 *              检查 DMA 触发器 0 事件中断标志（需先使能）。
 *
 *  Checks if DMA Trigger 0 Event that was previously enabled is pending.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 0 Event is pending
 *              DMA 触发器 0 事件是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER0 if DMA Trigger 0 Event is pending
 *  @retval      0 if DMA Trigger 0 Event is not pending
 *
 *  @sa         DL_AES_enableDMATrigger0Event
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledDMATrigger0EventStatus(
    const AES_Regs *aes)
{
    return (aes->DMA_TRIG0.MIS & AES_DMA_TRIG0_IMASK_DMA0_MASK);
}

/**
 *  @brief      Check interrupt flag of DMA Trigger 1 Event
 *              检查 DMA 触发器 1 事件中断标志（需先使能）。
 *
 *  Checks if DMA Trigger 1 Event that was previously enabled is pending.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 1 Event is pending
 *              DMA 触发器 1 事件是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER1 if DMA Trigger 1 Event is pending
 *  @retval      0 if DMA Trigger 1 Event is not pending
 *
 *  @sa         DL_AES_enableDMATrigger1Event
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledDMATrigger1EventStatus(
    const AES_Regs *aes)
{
    return (aes->DMA_TRIG1.MIS & AES_DMA_TRIG1_IMASK_DMA1_MASK);
}

/**
 *  @brief      Check interrupt flag of DMA Trigger 2 Event
 *              检查 DMA 触发器 2 事件中断标志（需先使能）。
 *
 *  Checks if DMA Trigger 2 Event that was previously enabled is pending.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 2 Event is pending
 *              DMA 触发器 2 事件是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER2 if DMA Trigger 2 Event is pending
 *  @retval      0 if DMA Trigger 2 Event is not pending
 *
 *  @sa         DL_AES_enableDMATrigger2Event
 */
__STATIC_INLINE uint32_t DL_AES_getEnabledDMATrigger2EventStatus(
    const AES_Regs *aes)
{
    return (aes->DMA_TRIG2.MIS & AES_DMA_TRIG2_IMASK_DMA2_MASK);
}

/**
 *  @brief      Check interrupt flag of AES Ready interrupt
 *              检查 AES 就绪原始中断标志（无需先使能中断）。
 *
 *  Checks if AES Ready Interrupt is pending. Interrupt does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If AES Ready interrupt is pending
 *              AES 就绪中断是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER0 if AES Ready interrupt is pending
 *  @retval      0 if AES Ready interrupt is not pending
 */
__STATIC_INLINE uint32_t DL_AES_getRawInterruptStatus(const AES_Regs *aes)
{
    return (aes->CPU_INT.RIS & AES_CPU_INT_IMASK_AESRDY_MASK);
}

/**
 *  @brief      Check interrupt flag of DMA Trigger 0 Event
 *              检查 DMA 触发器 0 原始事件标志（无需先使能）。
 *
 *  Checks if DMA Trigger 0 Event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 0 Event is pending
 *              DMA 触发器 0 事件是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER0 if DMA Trigger 0 Event is pending
 *  @retval      0 if DMA Trigger 0 Event is not pending
 */
__STATIC_INLINE uint32_t DL_AES_getRawDMATrigger0EventStatus(
    const AES_Regs *aes)
{
    return (aes->DMA_TRIG0.RIS & AES_DMA_TRIG0_IMASK_DMA0_MASK);
}

/**
 *  @brief      Check interrupt flag of DMA Trigger 1 Event
 *              检查 DMA 触发器 1 原始事件标志（无需先使能）。
 *
 *  Checks if DMA Trigger 1 Event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 1 Event is pending
 *              DMA 触发器 1 事件是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER0 if DMA Trigger 1 Event is pending
 *  @retval      0 if DMA Trigger 1 Event is not pending
 */
__STATIC_INLINE uint32_t DL_AES_getRawDMATrigger1EventStatus(
    const AES_Regs *aes)
{
    return (aes->DMA_TRIG1.RIS & AES_DMA_TRIG1_IMASK_DMA1_MASK);
}

/**
 *  @brief      Check interrupt flag of DMA Trigger 2 Event
 *              检查 DMA 触发器 2 原始事件标志（无需先使能）。
 *
 *  Checks if DMA Trigger 2 Event is pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     If DMA Trigger 2 Event is pending
 *              DMA 触发器 2 事件是否挂起。
 *
 *  @retval      DL_AES_EVENT_AES_DMA_TRIGGER0 if DMA Trigger 2 Event is pending
 *  @retval      0 if DMA Trigger 2 Event is not pending
 */
__STATIC_INLINE uint32_t DL_AES_getRawDMATrigger2EventStatus(
    const AES_Regs *aes)
{
    return (aes->DMA_TRIG2.RIS & AES_DMA_TRIG2_IMASK_DMA2_MASK);
}

/**
 *  @brief      Get highest priority pending AES interrupt
 *              获取最高优先级的挂起 AES 中断。
 *
 *  Checks if AES Ready Interrupt is pending. Interrupt does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     The highest priority pending AES interrupt
 *              最高优先级的挂起 AES 中断索引。
 */
__STATIC_INLINE DL_AES_IIDX DL_AES_getPendingInterrupt(const AES_Regs *aes)
{
    uint32_t interruptIdx = (uint32_t) aes->CPU_INT.IIDX;

    return (DL_AES_IIDX) interruptIdx;
}

/**
 *  @brief      Get highest priority pending DMA Trigger 0 Event
 *              获取最高优先级的挂起 DMA 触发器 0 事件。
 *
 *  Checks if DMA Trigger 0 Event os pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     The highest priority pending DMA Trigger 0 Event
 *              最高优先级的挂起 DMA 触发器 0 事件索引。
 */
__STATIC_INLINE DL_AES_IIDX DL_AES_getPendingDMATrigger0Event(
    const AES_Regs *aes)
{
    uint32_t eventIdx = (uint32_t) aes->DMA_TRIG0.IIDX;

    return (DL_AES_IIDX) eventIdx;
}

/**
 *  @brief      Get highest priority pending DMA Trigger 1 Event
 *              获取最高优先级的挂起 DMA 触发器 1 事件。
 *
 *  Checks if DMA Trigger 1 Event os pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     The highest priority pending DMA Trigger 1 Event
 *              最高优先级的挂起 DMA 触发器 1 事件索引。
 */
__STATIC_INLINE DL_AES_IIDX DL_AES_getPendingDMATrigger1Event(
    const AES_Regs *aes)
{
    uint32_t eventIdx = (uint32_t) aes->DMA_TRIG1.IIDX;

    return (DL_AES_IIDX) eventIdx;
}

/**
 *  @brief      Get highest priority pending DMA Trigger 2 Event
 *              获取最高优先级的挂起 DMA 触发器 2 事件。
 *
 *  Checks if DMA Trigger 2 Event os pending. Event does not have to
 *  be previously enabled.
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 *
 *  @return     The highest priority pending DMA Trigger 2 Event
 *              最高优先级的挂起 DMA 触发器 2 事件索引。
 */
__STATIC_INLINE DL_AES_IIDX DL_AES_getPendingDMATrigger2Event(
    const AES_Regs *aes)
{
    uint32_t eventIdx = (uint32_t) aes->DMA_TRIG2.IIDX;

    return (DL_AES_IIDX) eventIdx;
}

/**
 *  @brief      Clear pending AES Ready Interrupt
 *              清除挂起的 AES 就绪中断。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_clearInterruptStatus(AES_Regs *aes)
{
    aes->CPU_INT.ICLR |= AES_CPU_INT_IMASK_AESRDY_MASK;
}

/**
 *  @brief      Clear pending DMA Trigger 0 Event
 *              清除挂起的 DMA 触发器 0 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_clearDMATrigger0EventStatus(AES_Regs *aes)
{
    aes->DMA_TRIG0.ICLR |= AES_DMA_TRIG0_IMASK_DMA0_MASK;
}

/**
 *  @brief      Clear pending DMA Trigger 1 Event
 *              清除挂起的 DMA 触发器 1 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                             peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_clearDMATrigger1EventStatus(AES_Regs *aes)
{
    aes->DMA_TRIG1.ICLR |= AES_DMA_TRIG1_IMASK_DMA1_MASK;
}

/**
 *  @brief      Clear pending DMA Trigger 2 Event
 *              清除挂起的 DMA 触发器 2 事件。
 *
 *  @param[in]  aes           Pointer to the register overlay for the
 *                            peripheral
 *                            外设寄存器基地址指针。
 */
__STATIC_INLINE void DL_AES_clearDMATrigger2EventStatus(AES_Regs *aes)
{
    aes->DMA_TRIG2.ICLR |= AES_DMA_TRIG2_IMASK_DMA2_MASK;
}

/**
 *  @brief      Save AES configuration before entering a power loss state.
 *              Note that operation-specific variables (intermediate data,
 *              key, IV) will need to be re-loaded after picking up the
 *              peripheral from a powerloss state.
 *              在进入低功耗状态前保存 AES 配置。恢复后需重新加载操作相关变量。
 *
 *  @param[in]  aes  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 *
 *  @param[in]  ptr  Configuration backup setup structure. See
 *              @ref DL_AES_backupConfig.
 *                   配置备份结构体指针，参见 @ref DL_AES_backupConfig。
 *
 *  @retval     FALSE if a configuration already exists in ptr (will not be
 *              overwritten). TRUE if a configuration was successfully saved
 *              已存在配置返回 FALSE（不覆盖），成功保存返回 TRUE。
 */
bool DL_AES_saveConfiguration(const AES_Regs *aes, DL_AES_backupConfig *ptr);

/**
 *  @brief      Restore AES configuration after leaving a power loss state.
 *              Note that operation-specific variables (intermediate data,
 *              key, IV) will need to be re-loaded after picking up the
 *              peripheral from a powerloss state.
 *              从低功耗状态恢复后还原 AES 配置。恢复后需重新加载操作相关变量。
 *
 *  @param[in]  aes  Pointer to the register overlay for the peripheral
 *                   外设寄存器基地址指针。
 *
 *  @param[in]  ptr  Configuration backup setup structure. See
 *              @ref DL_AES_backupConfig.
 *                   配置备份结构体指针，参见 @ref DL_AES_backupConfig。
 *
 *  @retval     FALSE if a configuration does not exist in ptr (will not be
 *              loaded). TRUE if a configuration successfully loaded
 *              无配置返回 FALSE（不加载），成功加载返回 TRUE。
 */
bool DL_AES_restoreConfiguration(AES_Regs *aes, DL_AES_backupConfig *ptr);

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_AES__ */

#endif /* ti_dl_dl_aes__include */
/** @}*/
